<template>
  <section id="members">
    <div class="wrapper">
      <h2 class="h2 title">
        <span class="title__w1">у</span>
        <span>частники</span>
      </h2>
      <GeneralPartner class="members-gen" />
      <MembersList :items="items" @show:item="activeIndex = $event; showedItem = true" />
      <ModalShow v-if="activeItem" v-model="showedItem" :item="activeItem" />
    </div>
  </section>
</template>

<script setup>
  import GeneralPartner from '@/components/Members/GeneralPartner.vue';
  import MembersList from '@/components/Members/List.vue';
  import ModalShow from '@/components/Members/ModalShow.vue';
  import { computed, ref } from 'vue';

  const items = [
    {
      name: 'Таежная слобода',
      description: 'Мед с Горного Алтая',
      preview: '/members/таежная_слобода/preview.jpg',
      text: `
        Пчелоферма «Таёжная слобода»: Горный Алтай — медовый край!<br/>На Фестивале представит производимую эко-продукцию пчеловодства и премиальные сорта меда со всей России. В продаже будут: натуральный мед, перга, сборы трав, другие оздоровительные товары.<br/><br/>Зырянов Владимир Владимирович, общественный деятель, победитель конкурсов меда, профессиональный потомственный пчеловод, дипломированный медовый эксперт (сомелье) проведёт дегустации уникальных сортов мёда и раскроет все секреты производства высококачественного продукта. Расскажет какую пользу пчелопродукты несут для всей семьи.
      `,
      caption: 'Время дегустаций: 4-6 апреля с 10:00 до 22:00',
      logo: {
        width: '91',
        height: '100',
        src: '/members/таежная_слобода/logo.png',
      }
    },
    {
      name: 'BossBerry',
      description: 'Орехи и ягоды в шоколаде',
      preview: '/members/bossberry/preview.jpg',
      text: `
        BossBerry — магазин Правильных и Полезных сладостей. Более 60 видов драже. Ягоды в йогуртовой заливке. Орехи в бельгийском шоколаде. Хрустики без сахара.<br/><br/>На фестивале компания представит удивительные сладости премиум-класса торговой марки BossBerry, которые Вы не найдёте на полках обычных и дорогих супермаркетов. Отборные орехи и ягоды в йогуртовой заливке и в шоколаде, изготовленные по особому уникальному рецепту. Пастила в виде сухариков без сахара, мармелад на пектине из свежих ягод и фруктов. Все продукты улучшенной рецептуры, 100% натуральные, без пищевых красителей и химии.
      `,
      caption: 'Время дегустаций: 4-6 апреля с 10:00 до 22:00',
      logo: {
        width: '96',
        height: '100',
        src: '/members/bossberry/logo.png',
      }
    },
    {
      name: 'Сибирская воля',
      description: 'Пряники, взвары и сбитки',
      preview: '/members/сибирская_воля/preview.jpg',
      text: `
        Сибирская Воля — семейная компания по производству ремесленных сбитней и пряников по летописным рецептам 1905 года. Возрождаем гастрономические традиции Сибири!<br/><br/>На стенде будут представлены концентраты сбитней, печатные пряники из русской печи по рецепту 1905 года. Вся продукция будет представлена для дегустации с 10 до 22 ежедневно.<br/>Дегустация сбитня и пряника, рассказ о истории сбитня и пользе лечебных трав.
      `,
      caption: 'Время дегустаций: 4-6 апреля с 10:00 до 22:00',
      logo: {
        width: '100',
        height: '100',
        src: '/members/сибирская_воля/logo.png',
      }
    },
    {
      name: 'Дом Конфеи',
      description: 'Шоколад ручной работы',
      preview: '/members/дом_конфеи/preview.jpg',
      text: `
        Шоколадная мастерская «Дом Конфеи» — это место, где рождается сказочный шоколад — тот, который не просто подарит вам наслаждение, но и расскажет волшебную историю о вас самих.<br/><br/>На фестивале на стенде "Дома Конфеи" вы сможете найти ремесленный шоколад на меду, шоколадные сеты с разными вкусами под разное настроение, птичье молоко, солёную карамель и шоколадно-ореховую пасту. Акция для всех посетителей фестиваля: При покупке 3-х сетов баночка сладкого десерта в подарок (на выбор солёная карамель или птичье молоко, или шоколадно-ореховая паста)!
      `,
      caption: 'Время: 4-6 апреля с 10:00 до 22:00',
      logo: {
        width: '210',
        height: '100',
        src: '/members/дом_конфеи/logo.png',
      }
    },
    {
      name: 'Кафе «Шеff на месте»',
      description: 'Авторские напитки и десерты',
      preview: '/members/кафе_шеff_на_месте/preview.jpg',
      text: `
        На фестивале будет представлен широкий ассортимент: авторские напитки — чаи, кофе в дрип пакетах, лимонады, молочные коктейли. Сэндвичи собственного производства. Авторские десерты - медовики, брауни, тирамису, дубайский шоколад, кейкпопсы, леденцы, шоколадные конфеты с сухофруктами.<br/><br/>Акция для гостей фестиваля: комбо — напиток и сэндвич, напиток и десерт по специальным ценам со скидкой 15%! На дегустации все гости фестиваля смогут попробовать сэндвичи, салаты, десерты: медовик, тирамису, шоколадный трайфл, шоколадный брауни.<br/><br/>Розыгрыш для гостей фестиваля: за любую покупку компания вручает купон для участия в розыгрыше большой плитки дубайского шоколада, гость должен вписать туда свой номер телефона и сбросить в барабан, который будет стоять на основной локации компании в Ауре. На купоне будет написано, где она находится.
      `,
      caption: 'Время дегустаций: 4 апреля с 17:00 до 18:00, 5 апреля с 16:00 до 17:00 и 6 апреля с 15:00 до 16:00',
      logo: {
        width: '100',
        height: '100',
        src: '/members/кафе_шеff_на_месте/logo.png',
      }
    },
    {
      name: 'Зефирель',
      description: 'Зефирные букеты и наборы',
      preview: '/members/зефирель/preview.jpg',
      text: `
        Компания «Зефирель» была основана в ноябре 2023 года. Авторская зефирная флористика — оригинальные букеты из вкусного и натурального зефира для тех, кто хочет удивить своих близких по поводу и без. «Вау! Их точно можно есть?» Такая реакция всегда преследует наши зефирные композиции. Многие рассказывают, что получатели бегут за вазой, чтобы поставить цветы из зефира.<br/><br/>Зефир натуральный, а состав его прост: сахар, яблочное и ягодное пюре. В нашем зефире на 30% меньше сахара ,чем в магазинном! Специально для фестиваля в продаже будут: зефиросендвичи, кругляши из ягодного зефира; букеты из зефирных цветов: роз, тюльпанов, пионов; зефирные цветочки в колбах, в капсулах; пряничные картины, нарисованные зефиром; хризантемы, тюльпаны, розы, пионы, гортензии в коробках.
      `,
      caption: 'Время дегустаций: 4 апреля с 18:00 до 20:00, 5 апреля с 17:00 до 19:00 и 6 апреля с 17:00 до 18:00',
      logo: {
        width: '131',
        height: '100',
        src: '/members/зефирель/logo.png',
      }
    },
    {
      name: 'Крошка Пряник',
      description: 'Пряники ручной работы',
      preview: '/members/крошка_пряник/preview.jpg',
      text: `«Крошка Пряник» — компания, в которой тесно связаны вкус и эмоции. Ароматные, нежные, вкусные, приготовленные с душой пряничные сувениры в комплекте с фирменным кофе прекрасно дополняют друг друга и подарят восторг вам и вашим близким.`,
      caption: 'Время дегустаций: 5 апреля с 16:00 до 17:00',
      logo: {
        width: '100',
        height: '100',
        src: '/members/крошка_пряник/logo.png',
      }
    },
    {
      name: 'Шоколатерия Chocolart',
      description: 'Шоколадные конфеты',
      preview: '/members/шоколатерия_chocolart/preview.jpg',
      text: `
        Шоколатерия Chocolart — первая семейная шоколатерия в Новосибирске, где искусство шоколада сочетается с мастерством и творческим подходом. Мы создаем авторские конфеты вручную на открытой кухне, а гости могут наблюдать за процессом их изготовления. Наши вкусы — это сочетание классики и смелых экспериментов: от пудры белых грибов с кориандром и тмином до сыра Брюност с лавандой. Мы используем только натуральные ингредиенты, высококачественный шоколад и необычные специи, чтобы каждый мог открыть для себя новые грани вкуса.<br/><br/>Особое внимание мы уделяем культуре какао и горячего шоколада. В Chocolart представлено более 10 видов какао, созданных на основе bean-to-bar шоколада. Например, какао со вкусом бородинского хлеба или «Мачете» — 100% темный шоколад без добавления сахара, обладающий ярким насыщенным вкусом. Вдохновленные историей и шоколадным искусством, мы развиваем проект дальше. В будущем Chocolart станет основой для историко-гастрономического центра «Шоколадный Мир», где гости смогут узнать историю шоколада, поучаствовать в какао-церемониях, создать свой авторский шоколад и увидеть завораживающие шоколадные скульптуры.<br/><br/>А пока мы приглашаем вас в нашу шоколатерию за новыми вкусами, впечатлениями и открытием шоколада с новой стороны! Ассортимент: конфеты ручной работы с изысканными и интересными вкусами: пудра белых грибов, жареная брусника, бобы тонка, жгучий манго и другие оригинальные сочетания. Трендовые шоколадные конфеты и плитки с Дубайской начинкой. Авторские десерты с дубайскими начинками: моти, макаронс, шу, дубайский чизкейк.<br/><br/>Активности на фестивале: фотозона со скульптурой «Шоколадный поцелуй» – идеальное место для ярких снимков и атмосферных кадров. Викторина об истории шоколада – гости смогут проверить свои знания и выиграть сладкие призы.
      `,
      caption: '',
      logo: {
        width: '117',
        height: '100',
        src: '/members/шоколатерия_chocolart/logo.png',
      }
    },
    {
      name: 'ПЫЖКА',
      description: 'Пышки',
      preview: '/members/пыжка/preview.jpg',
      text: `
        «ПыЖка» — первая современная молодежная пышечная. Здесь пекут пышки и пончики с ностальгией вкуса детства. К пышкам предлагают какао, чай, кофе, молочные коктейли. Чем мы отличаемся от обычной пышечной – у нас есть авторские блюда из пышек – пыЖмен и пыжГерл… но это лучше попробовать, чем об этом говорить!<br/><br/>Для гостей фестиваля пышечная устроит соревнования:<br/>5 и 6 апреля в 14:00 на стенде пышечной 5 человек старше 18 лет получат комплект пышек и воду для соревнования по поеданию пышек!
      `,
      caption: 'Время дегустаций: 5 апреля с 14:00 до 14:20, 6 апреля с 15:00 до 15:20',
      logo: {
        width: '100',
        height: '100',
        src: '/members/пыжка/logo.png',
      }
    },
    {
      name: 'Manna Confectionery',
      description: 'Самые большие эклеры',
      preview: '/members/manna_confectionery/preview.jpg',
      text: `
        MANNA — вкус, возносящий до небес! Представляем вашему вниманию самые большие эклеры в городе! 22 см удовольствия! Полностью натуральный состав: натуральные 33% сливки, шоколад, свежие ягоды. Умеренная сладость! Если вы в поисках нового гастрономического опыта, приглашаем вас попробовать гигантские эклеры.<br/><br/>Беспроигрышная лотерея при покупке эклеров с возможностью выиграть сертификат на любой эклер! А оставив отзыв о компании «Manna» в 2ГИС, вы получите в подарок к своему десерту ароматный листовой чай!
      `,
      caption: '',
      logo: {
        width: '183',
        height: '100',
        src: '/members/manna_confectionery/logo.png',
      }
    },
  ];

  const showedItem = ref(false);
  const activeIndex = ref(null);
  const activeItem = computed(() => {
    if(activeIndex.value === null) return null;
    return items[activeIndex.value];
  });
</script>

<style scoped lang="scss">
  .title {
    text-align: center;
    white-space: nowrap;
    line-height: 1;
    margin-bottom: 50px;

    @include sm {
      margin-bottom: 30px;
    }

    &__w1, &__w2 {
      display: inline-block;
    }

    &__w1 {
      text-transform: lowercase;
      transform: translateY(-0.2em);
    }
  }

  .members-gen {
    margin-bottom: 50px;

    @include sm {
      margin-bottom: 30px;
    }
  }
</style>
